PreProcessing/modules/directFlatPlateModule/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     simpleFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         100000;

deltaT          1;

writeControl    timeStep;

writeInterval   #calc "$endTime / 100" ;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

functions
{
    solverInfo
    {
        type            solverInfo;
        libs            ("libutilityFunctionObjects.so");
        writeResidualFields no;
        fields          ("U" "p");
    }

    yPlus
    {
        type                 yPlus;
        libs                 ("libfieldFunctionObjects.so");
        executeControl       writeTime;
        writeControl         writeTime;
    }

    vorticity
    {
        type            vorticity;
        libs            ("libfieldFunctionObjects.so");
        executeControl  writeTime;
        writeControl    writeTime;
    }

    writeMidPlane
    {
        type            coded;
        libs            ("libutilityFunctionObjects.so");
        name            writeMidPlane;
        executeControl  writeTime;
        writeControl    none;

        codeInclude
        #{
            #include "OFstream.H"
            #include <fstream>
        #};

        codeExecute
        #{
            const fvMesh& mesh = refCast<const fvMesh>(obr_);
            const volVectorField& U =
                mesh.lookupObject<volVectorField>("U");
            const volScalarField& p =
                mesh.lookupObject<volScalarField>("p");
            // Vorticity (volVectorField; only ω_z is meaningful on the 2D
            // mid-plane). Mirrors TTCP/AirfoilLECase output schema.
            const volVectorField& vort =
                mesh.lookupObject<volVectorField>("vorticity");
            const vectorField& C = mesh.C();

            // Read output format from inputParam
            IOdictionary inputParam
            (
                IOobject
                (
                    "inputParam", "constant", mesh,
                    IOobject::MUST_READ, IOobject::NO_WRITE
                )
            );
            const dictionary& d = inputParam.subDict("Upinlet");
            const word fmt = d.lookupOrDefault<word>("outputFormat", "csv");
            const bool wallExtrap = d.lookupOrDefault<bool>("wallExtrapolation", false);

            const scalar zTarget   = 0.0;
            const scalar zMatchTol = 1e-9;   // FP match for the chosen plane

            // Pick a SINGLE z-plane: the cell-center z closest to zTarget.
            // Picking the nearest cell-center z (rather than a tolerance
            // window |z|<zTol) guarantees exactly one plane even on 2D-
            // extruded meshes that put multiple cells inside any reasonable
            // tolerance window (e.g. 2 cells in z at ±dz/2).
            scalar zPlane = zTarget;
            {
                scalar bestDz = GREAT;
                forAll(C, cellI)
                {
                    const scalar zi = C[cellI].z();
                    const scalar dz = mag(zi - zTarget);
                    if (dz < bestDz)
                    {
                        bestDz = dz;
                        zPlane = zi;
                    }
                }
                reduce(zPlane, minOp<scalar>());  // deterministic agreement across procs
            }

            // Collect cells whose center is on this single plane (FP match).
            DynamicList<label> cells;
            forAll(C, cellI)
            {
                if (mag(C[cellI].z() - zPlane) < zMatchTol)
                {
                    cells.append(cellI);
                }
            }

            // ── Wall extrapolation: add wall face centres with u=v=w=0 ──
            // Wall pressure is taken from the BC value (pw[fi]). For the
            // standard zeroGradient pressure BC this equals the owner-cell
            // pressure — the same value OpenFOAM integrates for forces and
            // the same one already exported in wall-quantity outputs.
            // The previous 2-point linear extrapolation assumed a vertical
            // wall normal (dist = C[ci].y() - fy) and a tight x-column
            // filter; both assumptions break on the bump's sloped region,
            // producing the same kind of artifacts seen in AirfoilLECase.
            DynamicList<label> wallFaces;
            DynamicList<scalar> wallP;
            DynamicList<scalar> wallOmz;
            if (wallExtrap)
            {
                label patchID = mesh.boundaryMesh().findPatchID("plate");
                if (patchID >= 0)
                {
                    const polyPatch& pp = mesh.boundaryMesh()[patchID];
                    const vectorField faceCentres(pp.faceCentres());  // copy to avoid dangling ref
                    const fvPatchScalarField& pw = p.boundaryField()[patchID];
                    // BC value of vorticity at the wall — for a no-slip patch
                    // OpenFOAM computes this as curl(U) at the boundary face,
                    // which equals -∂u/∂y (the wall shear gradient).
                    const fvPatchVectorField& vortW = vort.boundaryField()[patchID];

                    forAll(faceCentres, fi)
                    {
                        if (mag(faceCentres[fi].z() - zPlane) > zMatchTol) continue;
                        wallFaces.append(fi);
                        wallP.append(pw[fi]);
                        wallOmz.append(vortW[fi].z());
                    }

                    Info<< "writeMidPlane: wall extrapolation — "
                        << wallFaces.size() << " wall faces added" << endl;
                }
            }

            const fileName outDir =
                mesh.time().globalPath()/"postProcessing";
            mkDir(outDir);

            label totalRows = cells.size() + wallFaces.size();

            if (fmt == "binary")
            {
                const fileName fpath = outDir/"midPlane.bin";
                std::ofstream ofs(fpath, std::ios::binary);

                int32_t nCols = 8;
                int64_t nRows = totalRows;
                ofs.write(reinterpret_cast<const char*>(&nCols), sizeof(nCols));
                ofs.write(reinterpret_cast<const char*>(&nRows), sizeof(nRows));

                // Interior cells
                forAll(cells, i)
                {
                    const label ci = cells[i];
                    double row[8] =
                    {
                        C[ci].x(), C[ci].y(), C[ci].z(),
                        U[ci].x(), U[ci].y(), U[ci].z(),
                        p[ci], vort[ci].z()
                    };
                    ofs.write(reinterpret_cast<const char*>(row), sizeof(row));
                }

                // Wall points (u=v=w=0, p and omz from BC)
                if (wallExtrap)
                {
                    label patchID = mesh.boundaryMesh().findPatchID("plate");
                    const vectorField fc(mesh.boundaryMesh()[patchID].faceCentres());
                    forAll(wallFaces, i)
                    {
                        label fi = wallFaces[i];
                        double row[8] =
                        {
                            fc[fi].x(), fc[fi].y(), fc[fi].z(),
                            0.0, 0.0, 0.0,
                            wallP[i], wallOmz[i]
                        };
                        ofs.write(reinterpret_cast<const char*>(row), sizeof(row));
                    }
                }

                Info<< "writeMidPlane: wrote " << totalRows
                    << " rows (binary) to " << fpath << endl;
            }
            else
            {
                OFstream os(outDir/"midPlane.csv");
                // midPlane is the base flow for downstream linear-stability
                // analysis — write at max double precision (17 digits is the
                // round-trip-safe value for IEEE 754 binary64).
                os.precision(17);
                os << "x,y,z,u,v,w,p,omz" << nl;

                // Interior cells
                forAll(cells, i)
                {
                    const label ci = cells[i];
                    os  << C[ci].x() << ","
                        << C[ci].y() << ","
                        << C[ci].z() << ","
                        << U[ci].x() << ","
                        << U[ci].y() << ","
                        << U[ci].z() << ","
                        << p[ci]     << ","
                        << vort[ci].z() << nl;
                }

                // Wall points (u=v=w=0, p and omz from BC)
                if (wallExtrap)
                {
                    label patchID = mesh.boundaryMesh().findPatchID("plate");
                    const vectorField fc(mesh.boundaryMesh()[patchID].faceCentres());
                    forAll(wallFaces, i)
                    {
                        label fi = wallFaces[i];
                        os  << fc[fi].x() << ","
                            << fc[fi].y() << ","
                            << fc[fi].z() << ","
                            << 0.0 << ","
                            << 0.0 << ","
                            << 0.0 << ","
                            << wallP[i] << ","
                            << wallOmz[i] << nl;
                    }
                }

                Info<< "writeMidPlane: wrote " << totalRows
                    << " rows (csv) to " << os.name() << endl;
            }
        #};
    }
}


// ************************************************************************* //
