PreProcessing/modules/directFlatPlateModule/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2312                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include "../constant/inputParam"

dimensions      [ 0 1 -1 0 0 0 0 ];

internalField uniform ( ${Upinlet.Uinf} 0 ${Upinlet.Winf} );

boundaryField
{
    outlet
    {
        type            zeroGradient;
    }
    plate
    {
        type            fixedValue;
        value           uniform ( 0 0 0 );
    }
    front
    {
        type            cyclic;
    }
    back
    {
        type            cyclic;
    }
    
    top
    {
	type            zeroGradient;
    }
    
    inlet
    {
        type            codedFixedValue;
        value           uniform ( 0 0 0 );
        name            fscInlet;
        
        codeInclude
    	#{
		#include "OFstream.H"
		#include "SortableList.H"
		#include "fvCFD.H"
		#include <cmath>
    	#};
        
        code
        #{
        	using namespace Foam;      
        	
        	// Matlab-like helpers 	
        	struct Matlab
		{
		    static List<scalar> linspace(scalar a, scalar b, label N)
		    {
		        List<scalar> v(N, Zero);
		        if (N<=1) { if (N==1) v[0]=a; return v; }
		        scalar h = (b-a)/scalar(N-1);
		        for (label i=0;i<N;i++) v[i]=a + h*scalar(i);
		        return v;
		    }
		    static List<scalar> zeros(label N){ return List<scalar>(N, Zero); }
		    static scalar interp1(const List<scalar>& x,
		                          const List<scalar>& y, scalar xq)
		    {
		        const label N=x.size();
		        if (N==0) return 0;
		        if (xq<=x[0]) return y[0];
		        if (xq>=x[N-1]) return y[N-1];
		        label hi=1;
		        while (hi<N && x[hi] < xq) ++hi;
		        const label lo = hi-1;
		        const scalar t = (xq - x[lo]) / ( (x[hi]-x[lo]) + VSMALL );
		        scalar tc=t; if (tc<0) tc=0; if (tc>1) tc=1;
		        return (1.0-tc)*y[lo] + tc*y[hi];
		    }
		};
		
		// Parameters
		// Defined in 0/inputParam
		IOdictionary userDict
		(
		    IOobject("inputParam","constant", this->db(),
		             IOobject::MUST_READ, IOobject::NO_WRITE)
		);
		
		const dictionary& d = userDict.subDict("Upinlet");
		
		// Inflow information
    		const scalar Uinf     = readScalar(d.lookup("Uinf"));    // chordwise velocity
    		const scalar Winf     = readScalar(d.lookup("Winf"));    // spanwise velocity   
    		const scalar x0       = readScalar(d.lookup("xInlet")); //  virtual LE distance
    		// Polinomyal coefficients
		scalar pa4=0, pa3=0, pa2=0, pa1=0, pa0=0;
		if (d.found("pa4"))  pa4  = readScalar(d.lookup("pa4"));
		if (d.found("pa3"))  pa3  = readScalar(d.lookup("pa3"));
		if (d.found("pa2"))  pa2  = readScalar(d.lookup("pa2"));
		if (d.found("pa1"))  pa1  = readScalar(d.lookup("pa1"));
		if (d.found("pa0"))  pa0  = readScalar(d.lookup("pa0"));
		
		// Regarding FSC numerical resolution
		const scalar y0 = 0.0;    // height of the wall
		
		// Viscosity (incompressible)
		IOdictionary transProps
		(
		    IOobject("transportProperties","constant", this->db(),
			     IOobject::MUST_READ, IOobject::NO_WRITE)
		);
		const scalar nu = readScalar(transProps.lookup("nu"));
		
		const scalar eps  = 1e-12;
       		
		const scalar shift  = x0;                 // see Casacuberta et al. (2022) for constant details (0.046849930057979)
		const scalar XsPos  = max(eps, shift);    // >0 guard
		const scalar L      = Foam::log(XsPos);
		const scalar dLdx   = 1.0 / ( shift );

		// P(L) and dP/dL 
		const scalar poly      = (((pa4*L + pa3)*L + pa2)*L + pa1)*L + pa0;
		const scalar dpoly_dL  = ((((4.0*pa4)*L + 3.0*pa3)*L + 2.0*pa2)*L + pa1) * dLdx;

		const scalar Ue    = Uinf * poly;
		const scalar dUedx = Uinf * dpoly_dL;
    		
		if (!std::isfinite(Ue) || Ue <= eps)
		{
		    FatalErrorInFunction << "Invalid Ue" << nl << exit(FatalError);
		}
    		
		// Hartree beta from Ue(x): beta = 2m/(1+m), m = (x/Ue) dUe/dx
		const scalar mFS = (x0/Ue) * dUedx;
		const scalar beta = 2.0*mFS/(mFS+1.0);
		
		// Patch handles
        	const fvPatch& pch = patch();
        	vectorField&   Ubf = *this;
        	const auto&    Cf  = pch.Cf();
		const label nAxis = 1; // y normal to inlet
		label spanAxis = 2;    // z as spanwise by default
    		
    		// Additional declarations for FSC-profile computation       	
		const scalar betaFSkan = beta;
		const scalar maxetaglobal = 200.0;

		scalar etaf;
		if ((-0.05 <= betaFSkan) && (betaFSkan <= 1.5)) etaf = 3.8;
		else                                            etaf = 2.8;

		scalar h = 1e-2;
		scalar epsTol = 1e-12;
		int    itermax = 100;

		scalar alpha1 = 1.3,  alpha2 = 1.35;
		scalar theta1 = 1.1,  theta2 = 1.2;
	
		(void)alpha1; (void)alpha2; (void)theta1; (void)theta2;

		// Helper to build uniform grid similar to matlab's linspace(0,etaf,etaf/h)
		auto makeGrid = [&](scalar a, scalar b, scalar step)->List<scalar>
		{
		    label N = label( (b - a)/step ); if (N < 2) N = 2;
		    List<scalar> v(N, Zero);
		    scalar dh = (b - a)/scalar(N - 1);
		    for (label i=0; i<N; ++i) v[i] = a + dh*scalar(i);
		    return v;
		};

		// RK4 integrator 
		auto RK4 = [&](List<scalar>& u1, List<scalar>& u2, List<scalar>& u3,
		               List<scalar>& u4, List<scalar>& u5,
		               scalar etafLoc, scalar hLoc, scalar betaLoc)
		{
		    const label N = u1.size();
		    const scalar deta = (N>1 ? etafLoc/(N-1) : hLoc);

		    for (label i=0; i<N-1; ++i)
		    {
		        const scalar F1=u1[i],  FP1=u2[i],  FPP1=u3[i];
		        const scalar G1=u4[i],  GP1=u5[i];

		        // k1
		        const scalar k1_F   = FP1;
		        const scalar k1_FP  = FPP1;
		        const scalar k1_FPP = - F1*FPP1 - betaLoc*(1.0 - FP1*FP1);
		        const scalar k1_G   = GP1;
		        const scalar k1_GP  = - F1*GP1;

		        // stage 2 
			const scalar F2   = F1   + 0.5*deta*k1_F;
			const scalar FP2  = FP1  + 0.5*deta*k1_FP;
			const scalar FPP2 = FPP1 + 0.5*deta*k1_FPP;
			const scalar GP2  = GP1  + 0.5*deta*k1_GP;

		        // k2
		        const scalar k2_F   = FP2;
		        const scalar k2_FP  = FPP2;
		        const scalar k2_FPP = - F2*FPP2 - betaLoc*(1.0 - FP2*FP2);
		        const scalar k2_G   = GP2;
		        const scalar k2_GP  = - F2*GP2;

		        // stage 3
			const scalar F3   = F1   + 0.5*deta*k2_F;
			const scalar FP3  = FP1  + 0.5*deta*k2_FP;
			const scalar FPP3 = FPP1 + 0.5*deta*k2_FPP;
			const scalar GP3  = GP1  + 0.5*deta*k2_GP;

		        // k3
		        const scalar k3_F   = FP3;
		        const scalar k3_FP  = FPP3;
		        const scalar k3_FPP = - F3*FPP3 - betaLoc*(1.0 - FP3*FP3);
		        const scalar k3_G   = GP3;
		        const scalar k3_GP  = - F3*GP3;

		        // stage 4
			const scalar F4   = F1   + deta*k3_F;
			const scalar FP4  = FP1  + deta*k3_FP;
			const scalar FPP4 = FPP1 + deta*k3_FPP;
			const scalar GP4  = GP1  + deta*k3_GP;

		        // k4
		        const scalar k4_F   = FP4;
		        const scalar k4_FP  = FPP4;
		        const scalar k4_FPP = - F4*FPP4 - betaLoc*(1.0 - FP4*FP4);
		        const scalar k4_G   = GP4;
		        const scalar k4_GP  = - F4*GP4;

		        // update
		        u1[i+1] = F1  + (deta/6.0)*(k1_F   + 2*k2_F   + 2*k3_F   + k4_F);
		        u2[i+1] = FP1 + (deta/6.0)*(k1_FP  + 2*k2_FP  + 2*k3_FP  + k4_FP);
		        u3[i+1] = FPP1+ (deta/6.0)*(k1_FPP + 2*k2_FPP + 2*k3_FPP + k4_FPP);
		        u4[i+1] = G1  + (deta/6.0)*(k1_G   + 2*k2_G   + 2*k3_G   + k4_G);
		        u5[i+1] = GP1 + (deta/6.0)*(k1_GP  + 2*k2_GP  + 2*k3_GP  + k4_GP);
		    }
		};

		// 1) Conditioning run
		{
		    List<scalar> eta = makeGrid(0.0, etaf, h);
		    const label N = eta.size();
		    List<scalar> u1(N, Zero), u2(N, Zero), u3(N, Zero), u4(N, Zero), u5(N, Zero);

		    List<scalar> alpha(itermax, Zero), solu2alpha(itermax, Zero);
		    List<scalar> theta(itermax, Zero), solu4theta(itermax, Zero);

		    alpha[0]=1.3; theta[0]=1.1; u1[0]=0; u2[0]=0; u4[0]=0; u3[0]=alpha[0]; u5[0]=theta[0];
		    RK4(u1,u2,u3,u4,u5, etaf, h, betaFSkan);
		    solu2alpha[0]=u2[N-1]; solu4theta[0]=u4[N-1];

		    alpha[1]=1.35; theta[1]=1.2; u1[0]=0; u2[0]=0; u4[0]=0; u3[0]=alpha[1]; u5[0]=theta[1];
		    RK4(u1,u2,u3,u4,u5, etaf, h, betaFSkan);
		    solu2alpha[1]=u2[N-1]; solu4theta[1]=u4[N-1];

		    int j;
		    for (j=2; j<itermax; ++j)
		    {
		        scalar denA = solu2alpha[j-1] - solu2alpha[j-2];
		        if (Foam::mag(denA) < VSMALL) denA = (denA>=0? VSMALL : -VSMALL);
		        scalar slopeA = (alpha[j-1] - alpha[j-2]) / denA;
		        alpha[j] = alpha[j-1] - slopeA*(solu2alpha[j-1] - 1.0);

		        scalar denT = solu4theta[j-1] - solu4theta[j-2];
		        if (Foam::mag(denT) < VSMALL) denT = (denT>=0? VSMALL : -VSMALL);
		        scalar slopeT = (theta[j-1] - theta[j-2]) / denT;
		        theta[j] = theta[j-1] - slopeT*(solu4theta[j-1] - 1.0);

		        u1[0]=0; u2[0]=0; u4[0]=0; u3[0]=alpha[j]; u5[0]=theta[j];
		        RK4(u1,u2,u3,u4,u5, etaf, h, betaFSkan);
		        solu2alpha[j]=u2[N-1]; solu4theta[j]=u4[N-1];

		        if (Foam::mag(solu2alpha[j]-1.0) < epsTol && Foam::mag(solu4theta[j]-1.0) < epsTol) break;
		    }
		    const scalar val3=u3[0], val5=u5[0];

		// 2) Further run to etaf=10
		etaf = 10.0;
		eta  = makeGrid(0.0, etaf, h);
		const label N2 = eta.size();

		// Reuse existing u1..u5 
		u1 = List<scalar>(N2, Zero);
		u2 = List<scalar>(N2, Zero);
		u3 = List<scalar>(N2, Zero);
		u4 = List<scalar>(N2, Zero);
		u5 = List<scalar>(N2, Zero);

		u1[0]=0; u2[0]=0; u4[0]=0; alpha[0]=val3;      theta[0]=val5;      u3[0]=alpha[0]; u5[0]=theta[0];
		RK4(u1,u2,u3,u4,u5, etaf, h, betaFSkan);
		solu2alpha[0]=u2[N2-1]; solu4theta[0]=u4[N2-1];

		// second trial
		u1 = List<scalar>(N2, Zero);
		u2 = List<scalar>(N2, Zero);
		u3 = List<scalar>(N2, Zero);
		u4 = List<scalar>(N2, Zero);
		u5 = List<scalar>(N2, Zero);

		u1[0]=0; u2[0]=0; u4[0]=0; alpha[1]=val3+1e-4; theta[1]=val5+1e-4; u3[0]=alpha[1]; u5[0]=theta[1];
		RK4(u1,u2,u3,u4,u5, etaf, h, betaFSkan);
		solu2alpha[1]=u2[N2-1]; solu4theta[1]=u4[N2-1];
		
		    for (j=2; j<itermax; ++j)
		    {
		        scalar denA = solu2alpha[j-1] - solu2alpha[j-2];
		        if (Foam::mag(denA) < VSMALL) denA = (denA>=0? VSMALL : -VSMALL);
		        scalar slopeA = (alpha[j-1] - alpha[j-2]) / denA;
		        alpha[j] = alpha[j-1] - slopeA*(solu2alpha[j-1] - 1.0);

		        scalar denT = solu4theta[j-1] - solu4theta[j-2];
		        if (Foam::mag(denT) < VSMALL) denT = (denT>=0? VSMALL : -VSMALL);
		        scalar slopeT = (theta[j-1] - theta[j-2]) / denT;
		        theta[j] = theta[j-1] - slopeT*(solu4theta[j-1] - 1.0);

		        u1[0]=0; u2[0]=0; u4[0]=0; u3[0]=alpha[j]; u5[0]=theta[j];
		        RK4(u1,u2,u3,u4,u5, etaf, h, betaFSkan);
		        solu2alpha[j]=u2[N2-1]; solu4theta[j]=u4[N2-1];

		        if (Foam::mag(solu2alpha[j]-1.0) < epsTol && Foam::mag(solu4theta[j]-1.0) < epsTol) break;
		    }
		    const scalar val33=u3[0], val55=u5[0];

		    // 3) Final RK4 to maxetaglobal
		    etaf = maxetaglobal;
		    List<scalar> etaFinal = makeGrid(0.0, etaf, h);
		    const label N3 = etaFinal.size();
		    List<scalar> f  = Matlab::zeros(N3);
		    List<scalar> fp = Matlab::zeros(N3);
		    List<scalar> fpp= Matlab::zeros(N3);
		    List<scalar> g  = Matlab::zeros(N3);
		    List<scalar> gp = Matlab::zeros(N3);

		    f[0]=0; fp[0]=0; fpp[0]=val33; g[0]=0; gp[0]=val55;
		    RK4(f,fp,fpp,g,gp, etaf, h, betaFSkan);
		    
			//  Compute delta_99 from FSC profile 
			scalar delta99 = 0.0;   // define in this scope 
			{
			    // FSC: y = eta / sqrt(((m+1)/2) * Ue/(nu*x))
			    const scalar etaToY =
				1.0 / Foam::sqrt( ((mFS + 1.0)/2.0) * Ue / max(eps, nu*x0) );

			    // Find eta_99 where fp(eta)=0.99 (linear interpolation)
			    scalar eta99 = etaFinal.back(); // fallback to max if not crossed
			    for (label i = 1; i < fp.size(); ++i)
			    {
				if (fp[i-1] < 0.99 && fp[i] >= 0.99)
				{
				    const scalar f1 = fp[i-1], f2 = fp[i];
				    const scalar e1 = etaFinal[i-1], e2 = etaFinal[i];
				    scalar t = (0.99 - f1) / ((f2 - f1) + VSMALL);
				    if (t < 0) t = 0; if (t > 1) t = 1;
				    eta99 = e1 + t*(e2 - e1);
				    break;
				}
			    }

			    delta99 = eta99 * etaToY;   
			}

		    // Expose arrays + scale
	            List<scalar> etaArr = etaFinal;
	            scalar etaScale = Foam::sqrt( ((mFS + 1.0)/2.0) * Ue / max(eps, nu*x0) );
	            
	            // Recover the wall-normal velocity component
	            const scalar vPrefac = - Foam::sqrt( nu*Ue / ( 2.0 * max(eps, x0) * max(eps, (mFS + 1.0)) ) );

		    // Apply to patch faces
		    const scalar y0wall = 0.0;

		    // Sanity check: the FSK ODE was integrated up to η = maxetaglobal.
		    // In physical units this caps at y_max = maxetaglobal / etaScale.
		    // If the inlet patch reaches higher, the interp1(η) lookup returns
		    // the asymptotic plateau (≈ 1) but may carry numerical noise that
		    // produces unphysical inflow values at the domain top — abort.
		    scalar maxYOnPatch = 0.0;
		    forAll(Cf, fI)
		    {
		        const scalar y = Cf[fI].component(nAxis) - y0wall;
		        if (y > maxYOnPatch) maxYOnPatch = y;
		    }
		    const scalar yMaxAllowed = maxetaglobal / max(etaScale, eps);
		    if (maxYOnPatch > yMaxAllowed)
		    {
		        FatalErrorInFunction
		            << "FSC inlet: inlet patch extends to y = " << maxYOnPatch
		            << " m, exceeding the FSK similarity domain"
		            << " (maxetaglobal = " << maxetaglobal
		            << " → y_max_allowed = " << yMaxAllowed << " m)." << nl
		            << "Either decrease the domain height or increase"
		            << " maxetaglobal in 0/U." << nl
		            << abort(FatalError);
		    }

		    forAll(Ubf, fI)
		    {
		        const scalar y = (Cf[fI].component(nAxis) - y0wall);
		        const scalar yPlus = (y>0? y:0);
		        const scalar e = etaScale * yPlus;

			const scalar uOverUe = Matlab::interp1(etaArr, fp, e);   // f'(eta)
			const scalar wOverW  = Matlab::interp1(etaArr, g , e);
			
			const scalar fEta    = Matlab::interp1(etaArr, f , e);   // f(eta)
			const scalar fpEta   = uOverUe;                          // reuse f'(eta)
			const scalar vVal    = vPrefac * ( (mFS + 1.0)*fEta + (mFS - 1.0)*fpEta*e );

		        vector Uval(Zero);
		        Uval[0]        = Ue * uOverUe;   // streamwise
		        Uval[nAxis]    = vVal;           // wall-normal
		        Uval[spanAxis] = Winf * wOverW;  // spanwise
		        Ubf[fI]        = Uval;
		    }

			// Write one-line summary with Uinf, Winf, xInlet, beta_H, dUedx, delta99
			{
			    static bool dumped = false;
			    if (!dumped)
			    {
				Foam::OFstream os(this->db().time().path()/"FSC_inletData.dat"); 
				os.setf(std::ios::scientific); os.precision(8);
				os << "# Uinf Winf xInlet beta_H dUedx delta99\n";
				os << Uinf << " " << Winf << " " << x0 << " "
				   << beta << " " << dUedx << " " << delta99 << "\n";
				dumped = true;
			    }
			}
		    
		    	// Store inlet profile to file
			{
			    static bool dumped = false;
			    if (!dumped)
			    {
				Foam::OFstream os(this->db().time().path()/"FSC_inletProfile.dat");
				os.setf(std::ios::scientific); os.precision(8);
				os << "# y   ux   uy   uz\n";

				forAll(Ubf, i)
				{
				    const scalar y  = max(0.0, Cf[i].component(nAxis) - y0);
				    const scalar ux = Ubf[i].component(0);         // streamwise (x)
				    const scalar uy = Ubf[i].component(nAxis);     // wall-normal (y)
				    const scalar uz = Ubf[i].component(spanAxis);  // spanwise
				    os << y << "  " << ux << "  " << uy << "  " << uz << "\n";
				}
				dumped = true;
			    }
			}
		}
	    #};	
	}
}

// ************************************************************************* //
