PreProcessing/modules/directFlatPlateModule/system/refineMeshDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      refineMeshDict;
}

set             refineBox1;

coordinateSystem global;

globalCoeffs
{
    tan1    (1 0 0);
    tan2    (0 1 0);
}

directions      (tan1);

useHexTopology  yes;

geometricCut    no;

writeMesh       no;
