PreProcessing/modules/directFlatPlateModule/system/topoSetDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}

actions
(
    {
        name    refineBox1;
        type    cellSet;
        action  new;
        source  boxToCell;
        box     (0.03833000000000002 -1 -1) (0.13833 1.02 1);
    }
    {
        name    refineBox2;
        type    cellSet;
        action  new;
        source  boxToCell;
        box     (0.050830000000000014 -1 -1) (0.12583 1.02 1);
    }
    {
        name    refineBox3;
        type    cellSet;
        action  new;
        source  boxToCell;
        box     (0.06333000000000001 -1 -1) (0.11333 1.02 1);
    }
);
